Revit 2027 API
ParameterTypeId.StructuralBeamStartAttachmentRefcolumnEnd Property
 "Start of Attachment to Reference Column"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamStartAttachmentRefcolumnEnd { get; }
Public Shared ReadOnly Property StructuralBeamStartAttachmentRefcolumnEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamStartAttachmentRefcolumnEnd {
	ForgeTypeId^ get ();
}
static member StructuralBeamStartAttachmentRefcolumnEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace